[{"id":1713567600,"title":"Remote Firework Ignition\r","slug":"2024-04-20-remote-firework-ignition","card_img":"/media/2023-10-01-remote-firework-ignition/london-fireworks.jpg\r","date":" April 20, 2024\r","content":"\r\nA few years ago I had an idea to create a remote firework firing system. The idea came from wanting to create something using RF signals which I had ordered boards to play with. It fascinated me that I could remotely trigger something without the unreliability of bluetooth and without an internet connection. Even before starting research for this project, I knew that I was likely not the first to come up with this idea. At first, I wasn't planning on making something different but just wanted to make something cool and learn from it.\r\n\r\n## First RF Test\r\n\r\n<iframe id=\"0uI0bi6iBv8\" title=\"Demo of RF signals being sent to the computer and its output.\" poster=\"maxresdefault\"></iframe>\r\n\r\n<figure>\r\n    <figcaption>First RF signal test shows the computer recieved output of the RF signal.</figcaption>\r\n</figure>\r\n\r\nThis initial test was to see if I could get the RF signals working with a generic RF remote I bought online, which I intended to use for the fireworks activator. The initial tests were a success! As you see from the video, my remote receives the signals, and the computer displays what it receives.\r\n\r\n<zoom>\r\n    <img className=\"post-img\" src=\"/media/2023-10-01-remote-firework-ignition/rf-signal-reciever-XY-MK-5V.jpg\" alt=\"The RF reciever board that was used.\" width=\"400\">\r\n</zoom>\r\n\r\n<figure>\r\n    <figcaption>The RF reciever I used. XY-MK-5V RF Reciever Module 433MHz</figcaption>\r\n</figure>\r\n\r\n## Second RF Test\r\n\r\n<iframe id=\"fq4xKHjIwF4\" title=\"Demo of the RF signal used to change the colour of an RGB LED.\" poster=\"maxresdefault\"></iframe>\r\n\r\n<figure>\r\n    <figcaption>Second RF signal test shows the RF signal controlling an RGB LED.</figcaption>\r\n</figure>\r\n\r\n<iframe id=\"gy3nSZKkDFQ\" title=\"Demo of the RF signal used to change the colour of an RGB LED.\" poster=\"maxresdefault\"></iframe>\r\n\r\n<figure>\r\n    <figcaption>Here I programmed the LED to use more colours.</figcaption>\r\n</figure>\r\n\r\nAfter successfully conducting my RGB LED tests, I feel confident about this project's potential. Using this board, it seemed that I could trigger a firework remotely, which is a significant realisation and step forward.\r\n\r\nInitially, I struggled because I found more difficulties to consider as I thought about it. I knew I would be using E-matches to trigger the fireworks fuses, but how would I even source those? What voltage do those require? My initial job was to get my hands on some of these.\r\n\r\n<zoom>\r\n    <img className=\"post-img\" src=\"/media/2023-10-01-remote-firework-ignition/talon-e-match.jpg\" alt=\"A single Talon electronic match\" width=\"600\">\r\n</zoom>\r\n\r\n<figure>\r\n    <figcaption>Talon E-match</figcaption>\r\n</figure>\r\n\r\n## Firework Test\r\n\r\nAfter doing some research on E-matches, they seemed to be readily available on specialist fireworks-selling sites. I found they also take very little to fire, two or three 18650 batteries would do the trick, so I used two for testing.\r\n\r\n<zoom>\r\n    <img className=\"post-img\" src=\"/media/2023-10-01-remote-firework-ignition/18650-battery.png\" alt=\"A single 18650 rechargeable battery.\" width=\"400\">\r\n</zoom>\r\n\r\n<figure>\r\n    <figcaption>18650 Rechargeable Battery</figcaption>\r\n</figure>\r\n\r\nBefore I get this to work on an E-match I wanted to see if I could deliver enough voltage to trigger anything remotely through an RF signal.\r\n\r\n<iframe id=\"zHjUKfPjhPM\" title=\"Demo of the RF signal being sent to a relay to light up an LED.\" poster=\"maxresdefault\"></iframe>\r\n\r\n<figure>\r\n    <figcaption>An RF signal turns an LED on briefly.</figcaption>\r\n</figure>\r\n\r\nThe prototype has reached a stage where an E-match could be attached to trigger a firework. Of course, I would prioritise adding more safety features before testing it on a real firework, but how about a small fuse instead?\r\n\r\n<iframe id=\"3tdBnFd1Pgs\" title=\"An e-match igniting a fuse from a distance using an RF signal.\" poster=\"maxresdefault\"></iframe>\r\n\r\n<figure>\r\n    <figcaption>The e-match ignites a fuse, triggered by an RF signal.</figcaption>\r\n</figure>\r\n\r\nI had triggered maybe two E-matches before this clip, but it was very cool to finally have something I could show on camera. Unfortunately, I burned the alligator clips on my helping hand soldering station to get this shot, but I think it was worth it.\r\n\r\n<zoom>\r\n<img className=\"post-img\" src=\"/media/2023-10-01-remote-firework-ignition/burnt-alligator-clip.jpg\" alt=\"\" width=\"1000\">\r\n</zoom>\r\n\r\n<figure>\r\n    <figcaption>Burnt alligator clip ):</figcaption>\r\n</figure>\r\n\r\nThis project has been an absolute joy, even though I've had to work on it during a time when I couldn't test it on fireworks due to legal restrictions in the UK. I'm considering revisiting this project with an update when I can test it on real fireworks and with additional safety features. Despite the limitations, this has been a fantastic learning experience for me, and I've thoroughly enjoyed every moment.\r\n\r\n## More thoughts\r\n\r\nInitially, I said I wanted to use RF because it particularly fascinated me over technology such as Bluetooth. Still, doing some research after I completed this project, I found that Bluetooth systems similar to this one were surprisingly expensive and usually came with an app that would have to be downloaded on the user's phone. I have a habit of seeing something that seems simple to me and thinking that I could make it cheaper, and this did intrigue me, especially since I have recently learned to use Flutter for my Home Security Robot project.\r\n\r\nFor now though I think I'm happy to put this project down and move on to the next. 😄"},{"id":1696892400,"title":"Home Security Robot\r","slug":"2023-10-10-home-security-robot","card_img":"/media/2023-10-06-home-security-robot/my-messy-robot-design.avif\r","date":"October 10, 2023\r","content":"\r\nI developed a home security proof of concept in May for my final year project at the University of Portsmouth. After iterating through several other ideas, I finalized this idea because it combined my love of programming with my love of electronics and engineering.\r\n\r\nThe idea came from Amazon's home security robot, [Astro](https://www.amazon.com/Introducing-Amazon-Astro/dp/B078NSDFSB). Although this robot is currently available under invite only as of writing this, it was revealed to sell for about $1500. I looked at this product and similar ones and thought I could make it cheaper while also scratching that mechanical and electronic engineering itch I had.\r\n\r\nThe idea was for a proof of concept, a fully autonomous robot that could detect objects in front of it and be accessed remotely through the internet.\r\n\r\nThe project was made in two main sections: the app and the robot.\r\n\r\n## The App\r\n\r\nThe app was made in Flutter, below is a demo of the app.\r\n\r\n<iframe id=\"QE4tuhMR4Xg\" title=\"Demonstration of a connection to the camera on the robot.\" poster=\"maxresdefault\"></iframe>\r\n\r\n<figure>\r\n    <figcaption>In the video I connect to the local IP address of the ESP32-CAM.</figcaption>\r\n</figure>\r\n\r\n## The Robot\r\n\r\nGiven more time, I could have made a nicer-looking and better-functioning robot, but since it was a proof of concept, I made this.\r\n\r\n<zoom>\r\n    <img className=\"post-img\" src=\"/media/2023-10-06-home-security-robot/my-messy-robot-design.avif\" alt=\"My home security robot.\">\r\n</zoom>\r\n\r\n<figure>\r\n    <figcaption>The final robot design.</figcaption>\r\n</figure>\r\n\r\nThe robot was made using a simple car kit I found on Amazon, and I modified the design by drilling a bunch of holes in the plastic. In retrospect, there were better ways of mounting stuff to this chassis.\r\n\r\n<iframe id=\"AAkUKtALuzk\" title=\"Demonstration of the robot, showcasing its collision avoidance.\" poster=\"maxresdefault\"></iframe>\r\n\r\n<figure>\r\n    <figcaption>A video demo of the robot, showcasing its collision avoidance.</figcaption>\r\n</figure>\r\n\r\nFor those interested in more of the technical aspects of this project, I made the source code available on [Github](https://github.com/al651/Home_Security_Robot) with further details in the [README](https://github.com/al651/Home_Security_Robot/blob/main/README.md) file.\r\n"},{"id":1695510000,"title":"The Development of This Website\r","slug":"2023-09-24-the-development-of-this-website","card_img":"/media/2023-09-24-the-development-of-this-website/website-icon.png\r","date":"September 24, 2023\r","content":"\r\nWelcome to my website! It took a lot of effort and time to create, as I wanted the website not to use a template, so I had to make everything from scratch.\r\n\r\nOne of the most significant reasons this website took so long is that I had never used React or JavaScript before, so I was going into this project essentially blind, teaching myself as I went. I ended up using HTMl, CSS and Javascript for this project with the React framework. I debated using more front-end platforms such as Gatsby and Tailwind but this being my first React project, I wanted to keep it simple.\r\n\r\nThe first place I went when starting was immediately to find websites that achieved what I was trying to achieve. I took note of their designs and had a look at some of the HTML code that the websites used. The idea was not to copy but to instead take inspiration and understand how things were done under the hood, it is what makes websites so intriguing for beginners. You can get a base understanding of every website by looking at the html code and how it's organised.\r\n\r\nDespite how long the site took to make, it did pay off overall because it allowed me to customise things to a level of detail that web design platforms like WordPress simply cannot. One perfect example of this is in the site's performance. Platforms such as WordPress offer plugins and functions created for the general website. However, if you want code that works best for a specific website and to understand how it's all working for further iterations, then coding it myself was ultimately the best option.\r\n\r\n<zoom>\r\n    <img width=\"1000\" height=\"400\" className=\"post-img\" src=\"/media/2023-09-24-the-development-of-this-website/site-performance.png\" alt=\"Site performance\">\r\n</zoom>\r\n\r\n<figure>\r\n    <figcaption>A high performance Lighthouse test report for the landing page.</figcaption>\r\n</figure>\r\n\r\nIt shouldn't be the end of my development on this website, though. Knowing myself, I will continue to iterate over time, but I am happy with this for now.\r\n\r\n## Update: 06/02/2024\r\n\r\nSince this site went live, I've been mostly working on making it more performant for low tier hardware and constantly evolving the mobile phone and small screen experience.\r\n\r\nOne of the biggest changes that I made which improved performance by 50% in some cases is making youtube embeds use a [lite-youtube-embed](https://github.com/paulirish/lite-youtube-embed). This form of rendering for iframe elements is said to be 224x faster and I have definitely felt the improvements on those pages.\r\n\r\n## Update: 21/05/2024\r\n\r\nI published a fairly major update to the website today, which I have been sitting on for a while. I made a website footer and included a section on the about page for certifications because the page always felt a bit too empty to me.\r\n\r\nEven though I wrote the code for these features a few months back, I decided to put it off until now. I wanted to finish some courses I was working on, but I realised it would take longer than expected, so I decided just to publish the update. It will make the site look better, too, and I can always add the certifications later on."}]