[{"id":1696892400,"title":"Home Security Robot\r","slug":"2023-10-10-home-security-robot","card_img":"/media/2023-10-06-home-security-robot/my-messy-robot-design.png\r","date":"October 10, 2023\r","content":"\r\nBack in May, I developed a home security proof of concept for my final year project at the University of Portsmouth. I finalised this idea after iterating through several other ideas because it combined my love of programming with my love of electronics and engineering.\r\n\r\nThe project was made in two main sections: the app and the robot.\r\n\r\n## The App\r\n\r\nThe app was made in Flutter, below is a demo of the app.\r\n\r\n<div className=iframe-wrapper>\r\n    <iframe allow=\"fullscreen; picture-in-picture;\" allowfullscreen=\"\" src=\"https://www.youtube.com/embed/QE4tuhMR4Xg\" style=\"position: absolute; top: 0px; left: 0px; width: 100%; height: 100%;\"></iframe>\r\n</div>\r\n\r\n<figure>\r\n    <figcaption>In the video I connect to the local IP address of the ESP32-CAM.</figcaption>\r\n</figure>\r\n\r\n## The Robot\r\n\r\nGiven more time, I could have made a nicer-looking and better-functioning robot, but since it was a proof of concept, I made this.\r\n\r\n<figure>\r\n    <img className=\"post-img\" src=\"/media/2023-10-06-home-security-robot/my-messy-robot-design.png\" alt=\"My home security robot.\">\r\n    <figcaption>The final robot design.</figcaption>\r\n</figure>\r\n\r\nThe robot was made using a simple car kit I found on Amazon, and I modified the design by drilling a bunch of holes in the plastic. In retrospect, there were better ways of mounting stuff to this chassis.\r\n\r\n<div className=iframe-wrapper>\r\n    <iframe allow=\"fullscreen; picture-in-picture;\" allowfullscreen=\"\" src=\"https://www.youtube.com/embed/AAkUKtALuzk\" style=\"position: absolute; top: 0px; left: 0px; width: 100%; height: 100%;\"></iframe>\r\n</div>\r\n\r\n<figure>\r\n    <figcaption>A video demo of the robot, showcasing its collision avoidance.</figcaption>\r\n</figure>\r\n\r\nFor the more technical aspects of this project, I made it all available on GitHub with some more technical details, including the connections and all of the code I wrote. It can be found <a className=\"extlink\" href=\"https://github.com/al651/Home_Security_Robot\">here</a>.\r\n"},{"id":1695510000,"title":"The Development of This Website\r","slug":"2023-09-24-the-development-of-this-website","card_img":"/media/2023-09-24-the-development-of-this-website/website-icon.png\r","date":"September 24, 2023\r","content":"\r\nWelcome to my website! It took a lot of effort and time to create, as I wanted the website not to use a template, so I had to make everything from scratch.\r\n\r\nOne of the most significant reasons this website took so long is that I had never used React or JavaScript before, so I was going into this project essentially blind, teaching myself as I went. I ended up using HTMl, CSS and Javascript for this project with the React framework. I debated using more front-end platforms such as Gatsby and Tailwind but this being my first React project, I wanted to keep it simple.\r\n\r\nThe first place I went when starting was immediately to find websites that achieved what I was trying to achieve. I took note of their designs and had a look at some of the HTML code that the websites used. The idea was not to copy but to instead take inspiration and understand how things were done under the hood, it is what makes websites so intriguing for beginners. You can get a base understanding of every website by looking at the html code and how it's organised.\r\n\r\nDespite how long the site took to make, it did pay off overall because it allowed me to customise things to a level of detail that web design platforms like WordPress simply cannot. One perfect example of this is in the site's performance. Platforms such as WordPress offer plugins and functions created for the general website. However, if you want code that works best for a specific website and to understand how it's all working for further iterations, then coding it myself was ultimately the best option.\r\n\r\n<figure>\r\n    <img className=\"post-img\" src=\"/media/2023-09-24-the-development-of-this-website/site-performance.png\" alt=\"Site performance\">\r\n    <figcaption>A high performance Lighthouse test report for the landing page.</figcaption>\r\n</figure>\r\n\r\nIt shouldn't be the end of my development on this website, though. Knowing myself, I will continue to iterate over time, but I am happy with this for now.\r\n\r\n"}]